alanesq/esp32cam-demo/ESP32cam-demo.ino
 //   ****** examples of using the resulting RGB data *****

   // display some of the resulting data
       uint32_t resultsToShow = 50;                                                                       // how much data to display
       sendText(client,"<br>R,G,B data for first " + String(resultsToShow / 3) + " pixels of image");
       for (uint32_t i = 0; i < resultsToShow-2; i+=3) {
         sendText(client,String(rgb[i+2]) + "," + String(rgb[i+1]) + "," + String(rgb[i+0]));           // Red , Green , Blue
         // // calculate the x and y coordinate of the current pixel
         //   uint16_t x = (i / 3) % fb->width;
         //   uint16_t y = floor( (i / 3) / fb->width);
       }

   // find the average values for each colour over entire image
       uint32_t aRed = 0;
       uint32_t aGreen = 0;
       uint32_t aBlue = 0;
       for (uint32_t i = 0; i < (ARRAY_LENGTH - 2); i+=3) {                                               // go through all data and add up totals
         aBlue+=rgb[i];
         aGreen+=rgb[i+1];
         aRed+=rgb[i+2];
       }
       aRed = aRed / (fb->width * fb->height);                                                            // divide total by number of pixels to give the average value
       aGreen = aGreen / (fb->width * fb->height);
       aBlue = aBlue / (fb->width * fb->height);
       sendText(client,"Average Blue = " + String(aBlue));
       sendText(client,"Average Green = " + String(aGreen));
       sendText(client,"Average Red = " + String(aRed));
       sendText(client,"Image luminance = " + String( aRed * 0.3 + aGreen * 0.59 + aBlue * 0.11 ) );


 //   *******************************************************

 client.write("<br><a href='/'>Return</a>\n");       // link back
 sendFooter(client);     // close web page

 // finished with the data so free up the memory space used in psram
   esp_camera_fb_return(fb);   // camera frame buffer
   heap_caps_free(ptrVal);     // rgb data

}  // readRGBImage


// ----------------------------------------------------------------
//                      -get time from ntp server
// ----------------------------------------------------------------

bool getNTPtime(int sec) {

   uint32_t start = millis();      // timeout timer

   do {
     time(&now);
     localtime_r(&now, &timeinfo);
     if (serialDebug) Serial.print(".");
     delay(100);
   } while (((millis() - start) <= (1000 * sec)) && (timeinfo.tm_year < (2016 - 1900)));

   if (timeinfo.tm_year <= (2016 - 1900)) return false;  // the NTP call was not successful
   if (serialDebug) {
     Serial.print("now ");
     Serial.println(now);
   }

   // Display time
   if (serialDebug)  {
     char time_output[30];
     strftime(time_output, 30, "%a  %d-%m-%y %T", localtime(&now));
     Serial.println(time_output);
     Serial.println();
   }
 return true;
}


// ----------------------------------------------------------------
//     -capture jpg image and send    i.e. http://x.x.x.x/jpg
// ----------------------------------------------------------------

bool handleJPG() {

    const int maxJPGattempts = 3;             // max attempts to capture a frame
    const int maxTimeBeforeFrameDrop = 3000;  // it time since last capture over this then drop first frame

    WiFiClient client = server.client();
    if (!client.connected()) return false;

    camera_fb_t * fb = NULL;

    // the first frame can some times be an old one so if this is first capture in a while drop it
    static unsigned long lastjpgCall = 0;
    if(millis() - lastjpgCall >= maxTimeBeforeFrameDrop) {
      fb = esp_camera_fb_get();
      esp_camera_fb_return(fb);
      lastjpgCall = millis();
    }

    // Capture Loop
    for (int attempts = 0; attempts < maxJPGattempts; attempts++) {
        fb = esp_camera_fb_get();
        if (fb && fb->len > 0) break; 
        if (fb) esp_camera_fb_return(fb);
        fb = NULL;
        delay(50); 
    }

    if (!fb) {
        if (serialDebug) Serial.println("Err: Camera capture failed");
        // Send 500 error to client so they aren't left hanging
        client.println("HTTP/1.1 500 Internal Server Error\r\nContent-Type: text/plain\r\n\r\nCamera capture failed.");
        return false;
    }

    ImageResDetails = String(fb->width) + "x" + String(fb->height);    // store image size

    // Prepare headers
    // Using snprintf to safely format the full header block
    char hdr[150];
    int hdrLen = snprintf(hdr, sizeof(hdr),
        "HTTP/1.1 200 OK\r\n"
        "Access-Control-Allow-Origin: *\r\n"
        "Content-Type: image/jpeg\r\n"
        "Content-Length: %u\r\n"
        "Connection: close\r\n\r\n", 
        fb->len);

    // Send headers and image in as few packets as possible
    if (client.connected()) {
        client.write((const uint8_t *)hdr, hdrLen);
        client.write((const uint8_t *)fb->buf, fb->len);
    }

    // Cleanup
    esp_camera_fb_return(fb);
    
    // Give the client a moment to receive the data before closing the socket
    uint32_t waitTimeout = millis();
    while (client.connected() && (millis() - waitTimeout < 1000)) {
        delay(1);
    }
    
    client.stop();
    return true;
}


// ----------------------------------------------------------------
//      -stream requested     i.e. http://x.x.x.x/stream
// ----------------------------------------------------------------
// Sends video stream - thanks to Uwe Gerlach for the code showing me how to do this
// Note: when streaming video setting config.fb_count to 2 should increase performance 

void handleStream(){

  WiFiClient client = server.client();          // open link with client
  char buf[32];
  camera_fb_t * fb = NULL;

  // log page request including clients IP
    IPAddress cIP = client.remoteIP();
    if (serialDebug) Serial.println("Live stream requested by " + cIP.toString());

 // html
 const char HEADER[] = "HTTP/1.1 200 OK\r\n" \
                       "Access-Control-Allow-Origin: *\r\n" \
                       "Content-Type: multipart/x-mixed-replace; boundary=123456789000000000000987654321\r\n";
 const char BOUNDARY[] = "\r\n--123456789000000000000987654321\r\n";           // marks end of each image frame
 const char CTNTTYPE[] = "Content-Type: image/jpeg\r\nContent-Length: ";       // marks start of image data
 const int hdrLen = strlen(HEADER);         // length of the stored text, used when sending to web page
 const int bdrLen = strlen(BOUNDARY);
 const int cntLen = strlen(CTNTTYPE);
 client.write(HEADER, hdrLen);
 client.write(BOUNDARY, bdrLen);

// The original while loop block
while (true)
{
  // Check for excessive temperature
  float currentTemp = temperatureRead();
  if (currentTemp > MAX_TEMP_C) {
    if (serialDebug) {
      Serial.print("⚠️ WARNING: Overheating detected! Temperature: ");
      Serial.print(currentTemp);
      Serial.println("°C. Stopping stream.");
    }
    client.stop();
    break; // Exit the while loop to stop the streaming/capture process
  }

  // If client has closed connection
  if (!client.connected()) break;

  // Image Capture and Sending 
  fb = esp_camera_fb_get(); // capture live image as jpg
  if (!fb) {
    if (serialDebug) Serial.println("Error: failed to capture jpg image");
  } else {
    // send image
    client.write(CTNTTYPE, cntLen);             // send content type html (i.e. jpg image)
    sprintf( buf, "%d\r\n\r\n", fb->len);       // format the image's size as html and put in to 'buf'
    client.write(buf, strlen(buf));             // send result (image size)
    client.write((char *)fb->buf, fb->len);     // send the image data
    client.write(BOUNDARY, bdrLen);             // send html boundary      
    esp_camera_fb_return(fb);                   // return camera frame buffer
  }
}

 if (serialDebug) Serial.println("Video stream stopped");
 delay(3);
 client.stop();


}  // handleStream


// ----------------------------------------------------------------
//                        request a web page
// ----------------------------------------------------------------
//   @param    page         web page to request
//   @param    received     String to store response in
//   @param    maxWaitTime  maximum time to wait for reply (ms)
//   @returns  http code
// see:  https://randomnerdtutorials.com/esp32-http-get-post-arduino/#http-get-1
// to do:  limit size of reply

int requestWebPage(String* page, String* received, int maxWaitTime=5000){

