alanesq/esp32cam-demo/ESP32cam-demo.ino
  if (serialDebug) Serial.println("requesting web page: " + *page);

  WiFiClient client;
  HTTPClient http;     // see:  https://github.com/esp8266/Arduino/blob/master/libraries/ESP8266HTTPClient
  http.setTimeout(maxWaitTime);
  http.begin(client, *page);      // for https requires (client, *page, thumbprint)  e.g.String thumbprint="08:3B:71:72:02:43:6E:CA:ED:42:86:93:BA:7E:DF:81:C4:BC:62:30";
  int httpCode = http.GET();      // http codes: https://en.wikipedia.org/wiki/List_of_HTTP_status_codes
  if (serialDebug) Serial.println("http code: " + String(httpCode));

  if (httpCode > 0) {
    *received = http.getString();
  } else {
    *received = "error:" + String(httpCode);
  }
  if (serialDebug) Serial.println(*received);

  http.end();   //Close connection
  if (serialDebug) Serial.println("Web connection closed");

  return httpCode;

}  // requestWebPage


// ----------------------------------------------------------------
//       -show refreshing image    i.e. http://x.x.x.x/jpeg
// ----------------------------------------------------------------

void handleJpeg() {

  const int refreshRate = 2000;     // image refresh rate (ms)

  WiFiClient client = server.client();                 // open link with client

    // Start page
      client.write("HTTP/1.1 200 OK\r\n");
      client.write("Content-Type: text/html\r\n");
      client.write("Connection: close\r\n");
      client.write("\r\n");
      client.write("<!DOCTYPE HTML><html lang='en'>\n");
      client.write("<head></head><body>");

    client.write("<FORM action='/' method='post'>\n");            // used by the buttons in the html (action = the web page to send it to

    // capture and show a jpg image
      client.write("<img id='image1' src='/jpg'/>");     // show image from http://x.x.x.x/jpg

    // javascript to refresh the image periodically
      client.printf(R"=====(
         <script>
           function refreshImage(){
               var timestamp = new Date().getTime();
               var el = document.getElementById('image1');
               var queryString = '?t=' + timestamp;
               el.src = '/jpg' + queryString;
           }
           setInterval(function() { refreshImage(); }, %d);
         </script>
      )=====", refreshRate);        


  sendFooter(client);     // close web page
}  // handleJpeg


// ----------------------------------------------------------------
//                     resize grayscale image
// ----------------------------------------------------------------
// Thanks to Bard A.I. for writing this for me ;-)
//   src_buf: The source image buffer.
//   src_width: The width of the source image buffer.
//   src_height: The height of the source image buffer.
//   dst_buf: The destination image buffer.
//   dst_width: The width of the destination image buffer.
//   dst_height: The height of the destination image buffer.
void resize_esp32cam_image_buffer(uint8_t* src_buf, int src_width, int src_height,
                                   uint8_t* dst_buf, int dst_width, int dst_height) {
  // Calculate the horizontal and vertical resize ratios.
  float h_ratio = (float)src_width / dst_width;
  float v_ratio = (float)src_height / dst_height;

  // Iterate over the destination image buffer and write the resized pixels.
  for (int y = 0; y < dst_height; y++) {
    for (int x = 0; x < dst_width; x++) {
      // Calculate the source pixel coordinates.
      int src_x = (int)(x * h_ratio);
      int src_y = (int)(y * v_ratio);

      // Read the source pixel value.
      uint8_t src_pixel = src_buf[src_y * src_width + src_x];

      // Write the resized pixel value to the destination image buffer.
      dst_buf[y * dst_width + x] = src_pixel;
    }
  }
}


// ----------------------------------------------------------------
//                  Capture grayscale image data
// ----------------------------------------------------------------

void readGrayscaleImage() {

  WiFiClient client = server.client();                 // open link with client

  // html header
   sendHeader(client, "Access grayscale image data");  

  // change camera to grayscale mode  (by default it is in JPG colour mode)
    esp_camera_deinit();                           // disable camera
    delay(camChangeDelay);
    config.pixel_format = PIXFORMAT_GRAYSCALE;     // change camera setting to grayscale (default is JPG)
    initialiseCamera(0);                           // restart the camera (0 = without resetting all the other camera settings)
    cameraImageSettings(1);

  // capture the image and use flash if required
    int currentBrightness = brightLEDbrightness;
    if (flashRequired) {
        analogWrite(brightLED, 255);   // change LED brightness (0 - 255)
        delay(100);
    }
    camera_fb_t * fb = NULL;
    fb = esp_camera_fb_get();

    if (flashRequired){
        delay(100);
        analogWrite(brightLED, currentBrightness);            // change LED brightness back to previous state
    }
    if (!fb) {
        client.println("Error: Camera image capture failed");
        // Ensure we switch back even on failure
        esp_camera_deinit();
        delay(camChangeDelay);
        initialiseCamera(1);
        sendFooter(client); // Close page if needed
        return; // Exit
    }

  // // read image data and calculate average pixel value (as demonstration of reading the image data)
  // //      note:   image x = i % WIDTH, image y = floor(i / WIDTH)
  //   unsigned long dataSize = fb->width * fb->height;
  //   byte minV=255; byte maxV=0;
  //   for (int y=0; y < fb->height; y++) {
  //     for (int x=0; x < fb->width; x++) {   
  //       byte pixelVal = fb->buf[(y * fb->width) + x];
  //       if (pixelVal > maxV) maxV = pixelVal;
  //       if (pixelVal < minV) minV = pixelVal;
  //     }
  //   }
  //   client.print("Grayscale image: The lowest value pixel is " + String(minV) + ", the highest is " + String(maxV));  
  //   client.print("<br>");

  // resize the image
    int newWidth = 115;   int newHeight = 42;         // much bigger than this seems to cause problems, possible web page is too large?
    size_t newBufSize = newWidth * newHeight;
    byte* newBuf = (byte*)malloc(newBufSize); 
    if (!newBuf) {
        client.println("Error: Failed to allocate memory for resized buffer");
        esp_camera_fb_return(fb); // Clean up camera buffer
        // Switch back to JPG before returning
        esp_camera_deinit();
        delay(camChangeDelay);
        initialiseCamera(1);
        sendFooter(client); // Close page if needed
        return; // Exit
    }

    resize_esp32cam_image_buffer(fb->buf, fb->width, fb->height, newBuf, newWidth, newHeight);

