alanesq/esp32cam-demo/ESP32cam-demo.ino
  // Get the min and max values in the new resized image
    byte newminV=255; byte newmaxV=0;
    for (int y=0; y < newHeight; y++) {
      for (int x=0; x < newWidth; x++) {   
        byte pixelVal = newBuf[(y * newWidth) + x];
        if (pixelVal > newmaxV) newmaxV = pixelVal;
        if (pixelVal < newminV) newminV = pixelVal;
      }
    }
    client.printf("Resized image: The lowest value pixel is %d, the highest is %d\n", newminV, newmaxV);
    client.write("<br><br><a href='/'>Return</a>\n");       // link back    

  // display image as asciiArt
    char asciiArt[] = {'@','#','S','%','?','*','+',';',':',',','.',' ',' '};       // characters to use 
    int noAsciiChars = sizeof(asciiArt) / sizeof(asciiArt[0]);                 // number of characters available
    client.write("<br><pre style='line-height: 1.1;'>");                       // 'pre' stops variable character spacing, 'line-heigh' adjusts spacing between lines - 0.2
    for (int y=0; y < newHeight; y++) {
      client.write("\n");                                                      // new line
      for (int x=0; x < newWidth; x++) {   
        int tpos = map(newBuf[y*newWidth+x], newminV, newmaxV, 0, noAsciiChars - 1); // convert pixel brightness to ascii character  
        client.write(asciiArt[tpos]); 
      }
    }
    client.write("</pre><br>");

  // close web page
    sendFooter(client);    
    
  // close network client connection
    delay(3);
    client.stop();
    
  // free up memory
    free(newBuf);
    esp_camera_fb_return(fb);                 // return camera frame buffer

  // change camera back to JPG mode
    esp_camera_deinit();  
    delay(camChangeDelay);
    initialiseCamera(1);    // reset settings (1=apply the cameras settings which includes JPG mode)
  }


// ----------------------------------------------------------------
//   -reboot web page requested        i.e. http://x.x.x.x/reboot
// ----------------------------------------------------------------
// note: this can fail if the esp has just been reflashed and not restarted

void handleReboot(){

      String message = "Rebooting....";
      server.send(200, "text/plain", message);   // send reply as plain text

      // rebooting
        delay(500);          // give time to send the above html
        ESP.restart();
        delay(5000);         // restart fails without this delay
}


// ----------------------------------------------------------------
//   -switch GPIO pin via URL    i.e. http://x.x.x.x/switch?on=1
// ----------------------------------------------------------------

void handleSwitch() {

  WiFiClient client = server.client();             // open link with client

  String reply = "error - no command received";    // default message

    // switch gpio pin
      if (server.hasArg("on")) {   
          String Tvalue = server.arg("on");        // read value
          if (Tvalue != NULL) {
            int val = Tvalue.toInt();        
            if (val == 0) {
              digitalWrite(outputGPIOpin, !BonStatus);
              reply = "Switched off";
            }
            if (val == 1) {
              digitalWrite(outputGPIOpin, BonStatus);
              // bodge as relay seems to fail to switch for some reason???
                delay(20);
                digitalWrite(outputGPIOpin, BonStatus);
              reply = "Switched on";
            }
          }
      }     
  
  server.send(200, "text/plain", reply);           // send reply as plain "ok"
}      


// ----------------------------------------------------------------
//      -ping web page requested     i.e. http://x.x.x.x/ping
// ----------------------------------------------------------------

void handlePing() {

  WiFiClient client = server.client();         // open link with client
  
  server.send(200, "text/plain", "ok");        // send reply as plain "ok"
}        


// ----------------------------------------------------------------
//       -test procedure    i.e. http://x.x.x.x/test
// ----------------------------------------------------------------

void handleTest() {

 WiFiClient client = server.client();                                                        // open link with client

 // log page request including clients IP
   IPAddress cIP = client.remoteIP();
   if (serialDebug) Serial.println("Test page requested by " + cIP.toString());

 // html header
   sendHeader(client, "Testing");


 // html body


 // -------------------------------------------------------------------


// temp gpio test
pinMode(outputGPIOpin, INPUT);  
delay(3000);
pinMode(outputGPIOpin, OUTPUT);  

                          // test code goes here





// // demo of drawing on the camera image using javascript / html canvas
// //   could be of use to show area of interest on the image etc. - see https://www.w3schools.com/html/html5_canvas.asp
// // creat a DIV and put image in it with a html canvas on top of it
//   int imageWidth = 640;   // image dimensions on web page
//   int imageHeight = 480;
//   client.println("<div style='display:inline-block;position:relative;'>");
//   client.println("<img style='position:absolute;z-index:10;' src='/jpg' width='" + String(imageWidth) + "' height='" + String(imageHeight) + "' />");
//   client.println("<canvas style='position:relative;z-index:20;' id='myCanvas' width='" + String(imageWidth) + "' height='" + String(imageHeight) + "'></canvas>");
//   client.println("</div>");
// // javascript to draw on the canvas
//   client.println("<script>");
//   client.println("var imageWidth = " + String(imageWidth) + ";");
//   client.println("var imageHeight = " + String(imageHeight) + ";");
//   client.print (R"=====(
//     // connect to the canvas
//       var c = document.getElementById("myCanvas");
//       var ctx = c.getContext("2d");
//       ctx.strokeStyle = "red";
//     // draw on image
//       ctx.rect(imageWidth / 2, imageHeight / 2, 60, 40);                              // box
//       ctx.moveTo(20, 20); ctx.lineTo(200, 100);                                       // line
//       ctx.font = "30px Arial";  ctx.fillText("Hello World", 50, imageHeight - 50);    // text
//       ctx.stroke();
//    </script>\n)=====");


// // flip image horizontally
//   sensor_t *s = esp_camera_sensor_get();
//   s->set_hmirror(s, 1);


/*
 // demo of how to request a web page
   String page = "http://urlhere.com";   // url to request
   String response;                             // reply will be stored here
   int httpCode = requestWebPage(&page, &response);
   // show results
     client.println("Web page requested: '" + page + "' - http code: " + String(httpCode));
     client.print("<xmp>'");     // enables the html code to be displayed
     client.print(response);
     client.println("'</xmp><br>");
*/


/*
//  // demo useage of the mcp23017 io chipnote: this stops PWM on the flash working for some reason
    #if useMCP23017 == 1
      while(1) {
          mcp.digitalWrite(0, HIGH);
          int q = mcp.digitalRead(8);
          client.print("<p>HIGH, input =" + String(q) + "</p>");
          delay(1000);
          mcp.digitalWrite(0, LOW);
          client.print("<p>LOW</p>");
          delay(1000);
      }
    #endif
*/


 // -------------------------------------------------------------------

 client.println("<br><br><a href='/'>Return</a>");       // link back
 sendFooter(client);     // close web page

}  // handleTest


// ******************************************************************************************************************
// end
